type LargeCheckIconProps = {
  className?: string;
  size?: string | number; // 文字列と数字どちらでも受け取れるように
};

export function LargeCheckIcon({
  // デフォルトの値を設定
  className = "",
  size = 64,
}: LargeCheckIconProps) {
  return (
    <svg
      className={className}
      width={size}
      height={size}
      viewBox="0 0 64 64"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
    >
      <path
        d="M25.4667 40.4L48.0667 17.8C48.6 17.2667 49.2222 17 49.9333 17C50.6444 17 51.2667 17.2667 51.8 17.8C52.3333 18.3333 52.6 18.9671 52.6 19.7013C52.6 20.4356 52.3333 21.0684 51.8 21.6L27.3333 46.1333C26.8 46.6667 26.1778 46.9333 25.4667 46.9333C24.7556 46.9333 24.1333 46.6667 23.6 46.1333L12.1333 34.6667C11.6 34.1333 11.344 33.5004 11.3653 32.768C11.3867 32.0356 11.6649 31.4018 12.2 30.8667C12.7351 30.3316 13.3689 30.0649 14.1013 30.0667C14.8338 30.0684 15.4667 30.3351 16 30.8667L25.4667 40.4Z"
        fill="#D9042B"
      />
    </svg>
  );
}
